#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: Kappa distributions and elastic collisions
#+AUTHOR: William Henney
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+TODO: TODO NEXT STARTED | DONE CANCELED

*** Results of coronal loop ne, Te, \kappa diagnostics 
+ Width of coronal loop is about 3 arcsec
  + Radius of sun is 900 arcsec
  + So, about 0.0033 Rsun 

#+name: kappa-CoronalLoop-D15
| Region       | T / K | n / pcc |       H |  ln \Lambda |     \lambda_{e} |   Kn | \kappa |
|--------------+-------+---------+---------+-------+--------+------+---|
| average loop | 3.2e6 |   1.8e9 | 3.33e-3 | 21.26 | 7.02e7 | 0.30 | 2 |
| y=300-309    | 3.2e6 |   1.6e9 | 3.33e-3 | 21.32 | 7.88e7 | 0.34 | 2 |
#+TBLFM: $5=9.452 + 1.5 log($2) - 0.5 log($3) ; f2::$6=2.625e5 $2**2 /($3 $5) ;s3::$7=$6/$4 $Rsun; f2

+ So \kappa is very low (2), but the Knudsen number is relatively large, although not that large
+ Also, we haven't included any radial T gradients
  + If they are on smaller scale than 2e8 cm then they will affect Kn
+ And we haven't taken into account time-dependence
+ The microflares evolve on a timescale of minutes = 60 s
  + electron speed is ve = sqrt(k T/m) = 7e8 cm/s = 7000 km/s
  + so electron collision time is 7e7 / ve = 0.33 s
  + so collision time / evolution time = 5e-3, which is smaller than Kn
  + *Conclusion:* It is steep spatial gradients rather than fast timescales that produce the non-Maxwellian distributions

** Material from Dzifcakova & Kulinova (2011) 
+ Diagnostics of the \kappa-distribution using Si III lines in the solar transition region
+ Scale heights we can calculate from hydrostatic equilibrium:
  + H = c^2 / g
  + g = G M / R^2 = 6.673e-8 1.989e33 / 6.96e10**2 = 2.74e4
  + \rho c^2 = 2 n k T => c^2 = 2 k T / m
  + => H = 2 k T / m g 
+ But these are far too large!
  + The important thing is the T gradient (increasing outward), not the pressure gradient (decreasing outward)
  + From Table 3 of Shoub (1983), for n0 T0 = 6e14 K/cm3, we get this:
    |     z |     T |      n |    H_{T} |  ln \Lambda |     \lambda_{e} |   Kn |
    |-------+-------+--------+-------+-------+--------+------|
    |     0 | 8.1e3 | 7.4e10 | 4.2e2 | 10.44 | 2.23e1 | 0.05 |
    | 2.1e2 | 1.1e4 | 5.5e10 | 5.9e2 | 11.05 | 5.23e1 | 0.09 |
    | 1.1e3 | 2.0e4 |   3e10 | 3.2e3 | 12.24 | 2.86e2 | 0.09 |
    | 4.6e3 | 3.2e4 | 1.9e10 | 1.5e4 | 13.18 | 1.07e3 | 0.07 |
    | 1.6e4 | 4.6e4 | 1.3e10 | 5.3e4 | 13.91 | 3.07e3 | 0.06 |
    | 4.6e4 | 6.3e4 |  9.5e9 | 1.5e5 | 14.54 | 7.54e3 | 0.05 |
    | 1.7e5 | 9.3e4 |  6.5e9 | 5.9e5 | 15.31 | 2.28e4 | 0.04 |
    #+TBLFM: $3=6e14/$2;s2::$5=9.452 + 1.5 log($2) - 0.5 log($3) ; f2::$6=2.625e5 $2**2 /($3 $5) ;s3::$7=$6/$4; f2

*** DK11 Results of transition region diagnostics for T, n, \kappa 

#+name: kappa-TR-DK11
| Region        | T / K | n / pcc |     H |  ln \Lambda |     \lambda_{e} |   Kn |  \kappa |
|---------------+-------+---------+-------+-------+--------+------+----|
| Coronal Hole  | 2.5e4 |  1.4e10 |   6e3 | 12.96 | 9.04e2 | 0.15 | 13 |
| Quiet Sun     | 3.5e4 |   1.8e9 | 1.5e4 | 14.49 | 1.23e4 | 0.82 | 10 |
| Active Region |   1e4 |  1.3e10 | 5.9e2 | 11.62 | 1.74e2 | 0.29 |  7 |
#+TBLFM: $5=9.452 + 1.5 log($2) - 0.5 log($3) ; f2::$6=2.625e5 $2**2 /($3 $5) ;s3::$7=$6/$4; f2

Note that the Kn that 
*** DONE Esser & Edgar analysis
CLOSED: [2015-11-16 Mon 00:45]
+ I will calculate Kn for different radii in their model (Fig 1)
+ And will also estimate \kappa from their arguments about their Fig 2
  + They have a halo/core T ratio and n ratio, which we will have to translate into a \kappa
+ This works great - see table! 

#+name: kappa-SolarWind-EE00
| R/Rsun | T / K | n / pcc |    H |  ln \Lambda |      \lambda_{e} |     Kn | n_{h}/n_{c} | T_{h}/T_{c} |  \kappa |
|--------+-------+---------+------+-------+---------+--------+-------+-------+----|
|    1.0 |   5e5 |   3.8e8 | 0.07 | 19.26 |  8.97e6 | 1.8e-3 |  0.05 |    <2 | 20 |
|   1.25 |   9e5 |     1e7 | 0.07 | 21.96 |  9.68e8 |   0.20 |  0.05 |     5 |  3 |
|    1.5 |   9e5 |     1e6 |  0.2 | 23.11 |  9.20e9 |   0.66 |       |       | -1 |
|    2.0 |   7e5 |     2e5 |  0.4 | 23.54 | 2.73e10 |   0.98 |       |       | -1 |
|    2.4 |   6e5 |     1e5 |  0.4 | 23.65 | 4.00e10 |   1.44 |   0.2 |    18 |  2 |
#+TBLFM: $5=9.452 + 1.5 log($2) - 0.5 log($3) ; f2::$6=2.625e5 $2**2 /($3 $5) ;s3::$7=$6/$4 $Rsun; f2

*** Table of \xi_h versus \xi_t for equal thermal/non-thermal tail contribution
| \xi_t | B(\xi_t) |   E, keV |  \xi_h | \hat{u} f*_u | \Delta f_u(1+\beta) | f_h \tau_t / t_cool |
|-------+----------+----------+--------+--------------+---------------------+---------------------|
|     3 |   1.3e-4 |   1.1e-7 |   1e-2 |         3e-3 |                2e-3 |               2e-10 |
|   3.5 |   2.3e-3 |   2.0e-6 |   5e-2 |         1e-4 |                2e-4 |               3e-10 |
|     4 |   7.4e-2 |   6.3e-5 |    0.3 |         4e-6 |                1e-5 |               4e-10 |
|   4.5 |    4.0e0 |   3.4e-3 |    2.0 |         7e-8 |                3e-7 |               6e-10 |
|    5. |    3.7e2 |     0.31 |   19.2 |        8e-10 |                6e-9 |               7e-10 |
|   5.5 |    5.7e4 |    48.45 |  238.7 |        5e-12 |               6e-11 |               8e-10 |
|    6. |    1.5e7 | 12750.00 | 3873.0 |        2e-14 |               4e-13 |              1.0e-9 |
#+TBLFM: $2=1.2e-7 exp($1**2)/($1**2 - 1.5);s2::$3=$2*0.85/1000;f2::$4=sqrt($2);f1::$5=(4/sqrt($pi)) $1**2 exp(-$1**2); s1::$6=(4/sqrt($pi) 1.1**1.5) $1**2 exp(-($1**2)/1.1) - $5; s1::$7=3.7e-8 $1**3 15 0.1 / 2  1000 $1 ; s1
